In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

In [4]:
data = {
    'Name': [ 'Arun ','Dushyant','Sadhvi','Akash','karan',],
    'Age': [25,24,23,26,42],
    'Salary': [50000,52000,55000,32000,12000],
    'City': ['Faridabad','Aligarh','Narungabad','Nodia','Delhi']
}
Ds= pd.DataFrame(data)

In [5]:
Ds

       Name  Age  Salary        City
0     Arun    25   50000   Faridabad
1  Dushyant   24   52000     Aligarh
2    Sadhvi   23   55000  Narungabad
3     Akash   26   32000       Nodia
4     karan   42   12000       Delhi

    How to Save Different Data Format

In [7]:
Ds.to_csv('Ds.csv')

In [8]:
Ds.to_html('Ds.html')

In [9]:
Ds.to_json('Ds.json')

In [10]:
Ds.to_excel('Ds.xlsx')

    How to Load Different Data Load

In [12]:
Ds_csv=pd.read_csv('Ds.csv')
Ds_html=pd.read_html('Ds.html')
Ds_json=pd.read_json('Ds.json')
Ds_excel=pd.read_excel('Ds.xlsx')

In [13]:
Ds_csv

   Unnamed: 0      Name  Age  Salary        City
0           0     Arun    25   50000   Faridabad
1           1  Dushyant   24   52000     Aligarh
2           2    Sadhvi   23   55000  Narungabad
3           3     Akash   26   32000       Nodia
4           4     karan   42   12000       Delhi

In [20]:
Ds_html

[   Unnamed: 0      Name  Age  Salary        City
 0           0      Arun   25   50000   Faridabad
 1           1  Dushyant   24   52000     Aligarh
 2           2    Sadhvi   23   55000  Narungabad
 3           3     Akash   26   32000       Nodia
 4           4     karan   42   12000       Delhi]

In [21]:
Ds_json

       Name  Age  Salary        City
0     Arun    25   50000   Faridabad
1  Dushyant   24   52000     Aligarh
2    Sadhvi   23   55000  Narungabad
3     Akash   26   32000       Nodia
4     karan   42   12000       Delhi

In [23]:
Ds_html

[   Unnamed: 0      Name  Age  Salary        City
 0           0      Arun   25   50000   Faridabad
 1           1  Dushyant   24   52000     Aligarh
 2           2    Sadhvi   23   55000  Narungabad
 3           3     Akash   26   32000       Nodia
 4           4     karan   42   12000       Delhi]

In [29]:
Ds_csv.shape

(5, 5)

In [31]:
Ds_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         5 non-null      int64
 3   Salary      5 non-null      int64
 4   City        5 non-null      object
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes

In [33]:
Ds_csv.columns

Index(['Unnamed: 0', 'Name', 'Age', 'Salary', 'City'], dtype='object')

In [35]:
Ds_csv.describe()

       Unnamed: 0        Age        Salary
count    5.000000   5.000000      5.000000
mean     2.000000  28.000000  40200.000000
std      1.581139   7.905694  18143.869488
min      0.000000  23.000000  12000.000000
25%      1.000000  24.000000  32000.000000
50%      2.000000  25.000000  50000.000000
75%      3.000000  26.000000  52000.000000
max      4.000000  42.000000  55000.000000

In [37]:
Ds_csv.isnull().sum()

Unnamed: 0    0
Name          0
Age           0
Salary        0
City          0
dtype: int64

  Data Cleaning

In [40]:
Ds_csv

   Unnamed: 0      Name  Age  Salary        City
0           0     Arun    25   50000   Faridabad
1           1  Dushyant   24   52000     Aligarh
2           2    Sadhvi   23   55000  Narungabad
3           3     Akash   26   32000       Nodia
4           4     karan   42   12000       Delhi

In [42]:
Ds_csv.drop(['Unnamed: 0'], axis=1, inplace=True)

In [44]:
Ds_csv

       Name  Age  Salary        City
0     Arun    25   50000   Faridabad
1  Dushyant   24   52000     Aligarh
2    Sadhvi   23   55000  Narungabad
3     Akash   26   32000       Nodia
4     karan   42   12000       Delhi

In [46]:
import pandas as pd

In [48]:
data_list = [
    ['Dushyant', 24, 19000,'Manik Choak'],
    ['Sadhvi', 23, 35000,'Naurangabad'],
    ['Mohit', 25, 10000,'Paala'],
    ['Kiran', 22, 70000,'Agra'],
    ['Mukul', 21, 20000,'Aligarh'],
    ['Nandini', 20, 16000,'Spd']
]
DS = pd.DataFrame(data_list, columns=['Name', 'Age', 'Salary','City'])

In [50]:
DS

       Name  Age  Salary         City
0  Dushyant   24   19000  Manik Choak
1    Sadhvi   23   35000  Naurangabad
2     Mohit   25   10000        Paala
3     Kiran   22   70000         Agra
4     Mukul   21   20000      Aligarh
5   Nandini   20   16000          Spd

In [52]:
# 1. Grouping by 'City' and summing the 'Salary'
grouped_DS = DS.groupby('Name')['Salary'].sum()

In [58]:
grouped_DS = DS.groupby('Name')['Salary'].sum().pyplot(kind='bar')

AttributeError: 'Series' object has no attribute 'pyplot'

In [128]:
grouped_DS

Name
Dushyant    19000
Kiran       70000
Mohit       10000
Mukul       20000
Nandini     16000
Sadhvi      35000
Name: Salary, dtype: int64